CodeSaga/Embarcando no vagão Rails/Indo além do básico/app/controllers/home_controller.rb

  def welcome
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"