CodeSaga/Embarcando no vagão Rails/Indo além do básico/app/controllers/tasks_controller.rb

  def new
    @task = Task.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    # @task = Task.new(description: params[:task][:description], status: params[:task][:status])

    # evita códigos maliciosos
    @task = Task.new(params.require(:task).permit(:description, :status, :category_id))
    if @task.save # redireciona para root se for possível salvar
      redirect_to root_path
    else
      @categories = Category.all #disponibilizamos a variável para rodar o render
---
INSERT INTO "tasks" ("description", "status", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["description", "Comer"], ["status", "f"], ["created_at", "2019-02-05 15:52:00.751548"], ["updated_at", "2019-02-05 15:52:00.751548"], ["category_id", 1]]
SELECT "categories".* FROM "categories"

  def edit
    # utilizamos o params, dando uma olhada no routes vemos o nome do parâmetro na Rota de edit.
    @task = Task.find(params[:id])

    @categories = Category.all
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"

  def update
    @task = Task.find(params[:id])
    @task.update(params.require(:task).permit(:description, :status, :category_id))

    if @task.save # redireciona para root se for possível salvar
      redirect_to root_path
    else
      @categories = Category.all
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "category_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["category_id", 2], ["updated_at", "2019-02-05 15:57:21.164322"], ["id", 3]]
SELECT "categories".* FROM "categories"

    task = Task.find(params[:id]) # não precisamos de @ pois não temos view que usará esse objeto
    task.destroy #destrói a tarefa encontrada
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]